In [25]:
import pandas as pd

In [26]:
dict1 = {
    "name":["charan","chaco","zazu","walle"],
    "city":["after","before","future","past"],          
    "code":[1,2,3,4]
}

In [27]:
df = pd.DataFrame(dict1)
print(df)                     #this means to print the data into a table format

     name    city  code
0  charan   after     1
1   chaco  before     2
2    zazu  future     3
3   walle    past     4

In [28]:
df.to_csv("junkdata.csv")    #this means to print the dict values to csv file

In [29]:
df.to_csv("junkdata1.csv",index = False)   #this means to remove the index column from the csv file

In [30]:
df.head(3)  # this means to print first 3 rows of the data

     name    city  code
0  charan   after     1
1   chaco  before     2
2    zazu  future     3

In [33]:
df.tail(3)   # this means to print last 3 rows of the data

    name    city  code
1  chaco  before     2
2   zazu  future     3
3  walle    past     4

In [34]:
df.describe()    #this means to tell different calculations data like as shown in below output

           code
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [64]:
df.index = ["First","Second","Third","Fourth"]

In [65]:
df

          name    city  code
First   charan   after     1
Second   chaco  before     2
Third     zazu  future     3
Fourth   walle    past     4

In [37]:
data = pd.read_csv("advertising.csv")    #this means to read a csv file from the folder

In [38]:
data

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

In [59]:
a = data["Radio"][0] = 37.8
print(a)                            #this means to update the value given now to the datatable

37.8

In [60]:
print(data)

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3   12.0
3    151.5   41.3       58.5   16.5
4    180.8   10.8       58.4   17.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1   14.0
197  177.0    9.3        6.4   14.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   18.4

[200 rows x 4 columns]

In [61]:
data.to_csv("advertising.csv")    #this means to change the updated value to the csv file

In [62]:
data["Radio"][1]    #this means to print the index value datatable

39.3

In [63]:
data.describe()

               TV       Radio   Newspaper       Sales
count  200.000000  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000   15.130500
std     85.854236   14.846809   21.778621    5.283892
min      0.700000    0.000000    0.300000    1.600000
25%     74.375000    9.975000   12.750000   11.000000
50%    149.750000   22.900000   25.750000   16.000000
75%    218.825000   36.525000   45.100000   19.050000
max    296.400000   49.600000  114.000000   27.000000